# StructuralAnalysis Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..StructuralAnalysis Property
GroupTypeId Class See Also
---
Structural Analysis.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId StructuralAnalysis { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralAnalysis As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralAnalysis {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace